STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA25CE/Applications/BLE/BLE_Beacon_Scanner_AoA_Locator/STM32_WPAN/App/app_ble.c
/* Host stack buffers */
PLACE_IN_SECTION("TAG_HostStack") static uint32_t host_buffer[DIVC(BLE_DYN_ALLOC_SIZE, 4)];
PLACE_IN_SECTION("TAG_HostStack") static uint32_t gatt_buffer[DIVC(BLE_GATT_BUF_SIZE, 4)];
PLACE_IN_SECTION("TAG_HostStack") static uint16_t host_event_buffer[DIVC(BLE_HOST_EVENT_BUF_SIZE, 2)];
PLACE_IN_SECTION("TAG_HostStack") static uint64_t host_nvm_buffer[CFG_BLE_NVM_SIZE_MAX];
PLACE_IN_SECTION("TAG_HostStack") static uint8_t long_write_buffer[CFG_BLE_LONG_WRITE_DATA_BUF_SIZE];
PLACE_IN_SECTION("TAG_HostStack") static uint8_t extra_data_buffer[CFG_BLE_EXTRA_DATA_BUF_SIZE];

/* USER CODE BEGIN PV */

static uint8_t beacon_address[] = {0x66,0x77,0x88,0xE1,0x80,0x02};
/* USER CODE END PV */

/* Global variables ----------------------------------------------------------*/

/* USER CODE BEGIN GV */

/* USER CODE END GV */

/* Private function prototypes -----------------------------------------------*/
static uint8_t HOST_BLE_Init(void);
static void BLE_ResumeFlowProcessCallback(void);
static void BLE_NvmCallback(SNVMA_Callback_Status_t CbkStatus);
static void Ble_Hci_Gap_Gatt_Init(void);
static const uint8_t* BleGenerateIRValue(void);
static const uint8_t* BleGenerateERValue(void);
static void gap_cmd_resp_wait(void);
static void gap_cmd_resp_release(void);
/* USER CODE BEGIN PFP */
static void print_adv_name(uint16_t adv_data_len, uint8_t * adv_data);
static void print_beacon_data(uint16_t adv_data_len, uint8_t * adv_data, char * head_string);
/* USER CODE END PFP */

/* External functions prototypes ---------------------------------------------*/

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* External variables --------------------------------------------------------*/

/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Functions Definition ------------------------------------------------------*/
void APP_BLE_Init(void)
{
  /* USER CODE BEGIN APP_BLE_Init_1 */
  tBleStatus ret = BLE_STATUS_ERROR;
  /* USER CODE END APP_BLE_Init_1 */

  LST_init_head(&BleAsynchEventQueue);

  /* Register BLE Host tasks */
  UTIL_SEQ_RegTask(1U << CFG_TASK_BLE_HOST, UTIL_SEQ_RFU, BleStack_Process_BG);
  UTIL_SEQ_RegTask(1U << CFG_TASK_HCI_ASYNCH_EVT_ID, UTIL_SEQ_RFU, Ble_UserEvtRx);

  /* Initialise NVM RAM buffer, invalidate it's content before restoration */
  host_nvm_buffer[0] = 0;

  /* Register A NVM buffer for BLE Host stack */
  SNVMA_Register(APP_BLE_NvmBuffer,
                  (uint32_t *)host_nvm_buffer,
                  (CFG_BLE_NVM_SIZE_MAX * 2));

  /* Realize a restore */
  SNVMA_Restore(APP_BLE_NvmBuffer);
  /* USER CODE BEGIN APP_BLE_Init_Buffers */
  
  /* USER CODE END APP_BLE_Init_Buffers */

  /* Initialize BLE related modules */
  BAES_Reset( );
  PKACTRL_Reset();
  BLE_TIMER_Init();

  /* Initialize the BLE Host */
  if (HOST_BLE_Init() == 0u)
  {
    /* Initialization of HCI & GATT & GAP layer */
    Ble_Hci_Gap_Gatt_Init();

    /* Initialization of the BLE Services */
    SVCCTL_Init();

    /**
     * Initialize GATT Client Application
     */
    GATT_CLIENT_APP_Init();
  }
  /* USER CODE BEGIN APP_BLE_Init_2 */
  
  
  /* Setting parameters for the function aci_gap_start_observation_proc */
  ret = aci_gap_start_observation_proc(SCAN_INTERVAL_MS * 1000 / 625, /* LE_Scan_Interval: Scan interval in units of 0.625 ms */
                                       SCAN_WINDOW_MS * 1000 / 625,   /* LE_Scan_Window: Scan window in units of 0.625 ms */
                                       PASSIVE_SCAN,                  /* LE_Scan_Type: Scan type (0x00 for passive scanning) */
                                       0x00,                          /* Own_Address_Type: Own address type (0x00 for public address) */
                                       0x00,                          /* Filter_Duplicates: Duplicate filtering (0x00 for disabled) */
                                       0x00                           /* Scanning_Filter_Policy: Scanning filter policy (0x00 for basic unfiltered scanning filter policy) */
                                       );
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("aci_gap_start_observation_proc() failed:0x%02x\r\n", ret);
  }
  else
  {
    LOG_INFO_APP("aci_gap_start_observation_proc --> SUCCESS\r\n");
  } 
   
  
  /* Setting parameters for the function hci_le_periodic_advertising_create_sync */
  ret = hci_le_periodic_advertising_create_sync(0x00,                 /* Options: Use Advertising_SID, Advertiser_Address_Type, and Advertiser_Address parameters */
                                                0x00,                 /* Advertising_SID: Value of the Advertising SID subfield in the ADI field of the PDU (0x00) */
                                                0x00,                 /* Advertiser_Address_Type: Public Device Address or Public Identity Address (0x00) */
                                                beacon_address,       /* Advertiser_Address: Address of the advertiser */
                                                0x0000,               /* Skip: Maximum number of periodic advertising events that can be skipped (0x0000) */
                                                SYNC_TIMEOUT_MS / 10, /* Sync_Timeout: Synchronization timeout for the periodic advertising train in units of 10 ms */
                                                0x10                  /* Sync_CTE_Type: Do not sync to packets without a Constant Tone Extension (0x10) */
                                                );
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("hci_le_periodic_advertising_create_sync() failed:0x%02x\r\n", ret);
  }
  else
  {
    LOG_INFO_APP("hci_le_periodic_advertising_create_sync --> SUCCESS\r\n");
  }
  
  /* USER CODE END APP_BLE_Init_2 */

  return;
}

/* All BLE activities must be stopped before calling this API */
void APP_BLE_Deinit(void)
{
  /* USER CODE BEGIN APP_BLE_Deinit_1 */

  /* USER CODE END APP_BLE_Deinit_1 */

  aci_reset(0, 0);

  memset(&host_buffer[0], 0, sizeof(host_buffer));
  memset(&gatt_buffer[0], 0, sizeof(gatt_buffer));
  memset(&host_event_buffer[0], 0, sizeof(host_event_buffer));
  memset(&host_nvm_buffer[0], 0, sizeof(host_nvm_buffer));
  memset(&long_write_buffer[0], 0, sizeof(long_write_buffer));
  memset(&extra_data_buffer[0], 0, sizeof(extra_data_buffer));

