STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA25CE/Applications/BLE/BLE_Beacon_Scanner_AoA_Locator/STM32_WPAN/App/app_ble.c
          /* USER CODE BEGIN HCI_EVT_LE_ENHANCED_CONN_COMPLETE */

          /* USER CODE END HCI_EVT_LE_ENHANCED_CONN_COMPLETE */
          break; /* HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE */
        }
        case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
        {
          uint32_t conn_interval_us = 0;
          hci_le_connection_complete_event_rp0 *p_conn_complete;
          p_conn_complete = (hci_le_connection_complete_event_rp0 *) p_meta_evt->data;
          conn_interval_us = p_conn_complete->Conn_Interval * 1250;
          LOG_INFO_APP(">>== HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE - Connection handle: 0x%04X\n", p_conn_complete->Connection_Handle);
          LOG_INFO_APP("     - Connection established with @:%02x:%02x:%02x:%02x:%02x:%02x\n",
                      p_conn_complete->Peer_Address[5],
                      p_conn_complete->Peer_Address[4],
                      p_conn_complete->Peer_Address[3],
                      p_conn_complete->Peer_Address[2],
                      p_conn_complete->Peer_Address[1],
                      p_conn_complete->Peer_Address[0]);
          LOG_INFO_APP("     - Connection Interval:   %d.%02d ms\n     - Connection latency:    %d\n     - Supervision Timeout:   %d ms\n     - Status:               0x%02X\n",
                      conn_interval_us / 1000,
                      (conn_interval_us%1000) / 10,
                      p_conn_complete->Conn_Latency,
                      p_conn_complete->Supervision_Timeout * 10,
                      p_conn_complete->Status
                     );
          UNUSED(conn_interval_us);

          if (bleAppContext.Device_Connection_Status == APP_BLE_LP_CONNECTING)
          {
            /* Connection as client */
            bleAppContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;
          }
          else
          {
            /* Connection as server */
            bleAppContext.Device_Connection_Status = APP_BLE_CONNECTED_SERVER;
          }
          bleAppContext.connectionHandle = p_conn_complete->Connection_Handle;

          /* USER CODE BEGIN HCI_EVT_LE_CONN_COMPLETE */

          /* USER CODE END HCI_EVT_LE_CONN_COMPLETE */
          break; /* HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */
        }
        case HCI_LE_ADVERTISING_REPORT_SUBEVT_CODE:
        {
          hci_le_advertising_report_event_rp0 *p_adv_report;
          p_adv_report = (hci_le_advertising_report_event_rp0 *) p_meta_evt->data;
          UNUSED(p_adv_report);

          rssi = HCI_LE_ADVERTISING_REPORT_RSSI(p_meta_evt->data);
          UNUSED(rssi);

          /* USER CODE BEGIN HCI_EVT_LE_ADVERTISING_REPORT */
          
          /* USER CODE END HCI_EVT_LE_ADVERTISING_REPORT */
          break; /* HCI_LE_ADVERTISING_REPORT_SUBEVT_CODE */
        }
        case HCI_LE_EXTENDED_ADVERTISING_REPORT_SUBEVT_CODE:
        {
          hci_le_extended_advertising_report_event_rp0 *p_ext_adv_report;
          p_ext_adv_report = (hci_le_extended_advertising_report_event_rp0 *) p_meta_evt->data;
          UNUSED(p_ext_adv_report);
          /* USER CODE BEGIN HCI_LE_EXTENDED_ADVERTISING_REPORT_SUBEVT_CODE */
          
          uint16_t event_type =  p_ext_adv_report->Event_Type;
          
          if(event_type == 0x0010)
          {
            print_beacon_data(p_ext_adv_report->Data_Length, p_ext_adv_report->Data, "Beacon");
          }
          else if(event_type == 0x0000)
          {
            print_beacon_data(p_ext_adv_report->Data_Length, p_ext_adv_report->Data, "ExtAdv Beacon");
          }
          
          /* USER CODE END HCI_LE_EXTENDED_ADVERTISING_REPORT_SUBEVT_CODE */
          break; /* HCI_LE_EXTENDED_ADVERTISING_REPORT_SUBEVT_CODE */
        }
        /* USER CODE BEGIN SUBEVENT */
        
      case HCI_LE_PERIODIC_ADVERTISING_REPORT_SUBEVT_CODE:
        {
          hci_le_periodic_advertising_report_event_rp0 *p_periodic_adv_report;
          p_periodic_adv_report = (hci_le_periodic_advertising_report_event_rp0 *) p_meta_evt->data;
          
          print_beacon_data(p_periodic_adv_report->Data_Length, p_periodic_adv_report->Data, "Periodic Beacon");
          
          break;
        }
        
      case HCI_LE_PERIODIC_ADVERTISING_SYNC_ESTABLISHED_SUBEVT_CODE:
        {
          hci_le_periodic_advertising_sync_established_event_rp0 *p_periodic_adv_sync;
          p_periodic_adv_sync = (hci_le_periodic_advertising_sync_established_event_rp0 *) p_meta_evt->data;
          tBleStatus ret;
          uint8_t antenna_ids[] = SWITCHING_PATTERN;
          
          uint16_t sync_handle = p_periodic_adv_sync->Sync_Handle;
          
          LOG_INFO_APP("hci_le_periodic_advertising_sync_established_event --> EVENT\n");
          
          /* Scanning is no more needed. Disable it. */
          ret = aci_gap_terminate_gap_proc(GAP_OBSERVATION_PROC);
          if (ret != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("aci_gap_terminate_gap_proc() failed:0x%02x\n", ret);
          }
          else
          {
            LOG_INFO_APP("aci_gap_terminate_gap_proc --> SUCCESS\n");
          }
          
          ret = hci_le_set_connectionless_iq_sampling_enable(sync_handle,
                                                             ENABLE,
                                                             CTE_SLOT_1us,
                                                             0, /* Report all CTEs*/
                                                             sizeof(antenna_ids),
                                                             antenna_ids);
          if (ret != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("hci_le_set_connectionless_iq_sampling_enable() failed:0x%02x\n", ret);
          }
          else
          {
            LOG_INFO_APP("hci_le_set_connectionless_iq_sampling_enable --> SUCCESS\n");
          }
          break;
        }
      case HCI_LE_CONNECTIONLESS_IQ_REPORT_SUBEVT_CODE:
        {
          hci_le_connectionless_iq_report_event_rp0 *p_connless_iq_report;
          p_connless_iq_report = (hci_le_connectionless_iq_report_event_rp0 *) p_meta_evt->data;
          
          LOG_INFO_APP("*** IQ samples\n"); 
          const char * cte_type_str[3] = {"AoA", "AoD 1us", "AoD 2 us"};
          
          LOG_INFO_APP("IQ samples (%s): ", cte_type_str[p_connless_iq_report->CTE_Type]);
          for(int i = 0; i < p_connless_iq_report->Sample_Count; i++)
          {
            LOG_INFO_APP("(%d,%d)", p_connless_iq_report->IQ_Sample[i].I_Sample, p_connless_iq_report->IQ_Sample[i].Q_Sample);
          }
          LOG_INFO_APP("\n");
          break;
        }
      case HCI_LE_PERIODIC_ADVERTISING_SYNC_LOST_SUBEVT_CODE:
        {
          LOG_INFO_APP("Sync lost! Restart the scanner device to get again the Beacon AoA Tag IQ samples !\n");
          break;
        }
        /* USER CODE END SUBEVENT */
        default:
        {
          LOG_DEBUG_BLE("SVCCTL_App_Notification: unhandled SUBEVENT with opcode: 0x%02X\n", p_meta_evt->subevent);
          /* USER CODE BEGIN SUBEVENT_DEFAULT */
          
          /* USER CODE END SUBEVENT_DEFAULT */
          break;
        }
      }

      /* USER CODE BEGIN META_EVT */
      
      /* USER CODE END META_EVT */
    }
    break; /* HCI_LE_META_EVT_CODE */

    case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
    {
      p_blecore_evt = (evt_blecore_aci*) p_event_pckt->data;
      /* USER CODE BEGIN EVT_VENDOR */
      
      /* USER CODE END EVT_VENDOR */
      switch (p_blecore_evt->ecode)
      {
        /* USER CODE BEGIN ECODE */
        
        /* USER CODE END ECODE */
        case ACI_L2CAP_CONNECTION_UPDATE_REQ_VSEVT_CODE:
        {
          aci_l2cap_connection_update_req_event_rp0 *p_l2cap_conn_update_req;
          uint8_t req_resp = 0x01;
          p_l2cap_conn_update_req = (aci_l2cap_connection_update_req_event_rp0 *) p_blecore_evt->data;
          UNUSED(p_l2cap_conn_update_req);

          /* USER CODE BEGIN EVT_L2CAP_CONNECTION_UPDATE_REQ */
          
          /* USER CODE END EVT_L2CAP_CONNECTION_UPDATE_REQ */

          ret = aci_l2cap_connection_parameter_update_resp(p_l2cap_conn_update_req->Connection_Handle,
                                                           p_l2cap_conn_update_req->Interval_Min,
                                                           p_l2cap_conn_update_req->Interval_Max,
                                                           p_l2cap_conn_update_req->Latency,
                                                           p_l2cap_conn_update_req->Timeout_Multiplier,
                                                           CONN_CE_LENGTH_MS(10),
                                                           CONN_CE_LENGTH_MS(10),
                                                           p_l2cap_conn_update_req->Identifier,
                                                           req_resp);
          if(ret != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("  Fail   : aci_l2cap_connection_parameter_update_resp command\n");
          }
          else
          {
            LOG_INFO_APP("  Success: aci_l2cap_connection_parameter_update_resp command\n");
          }

          break;
        }
        case ACI_GAP_PROC_COMPLETE_VSEVT_CODE:
        {
          aci_gap_proc_complete_event_rp0 *p_gap_proc_complete;
          p_gap_proc_complete = (aci_gap_proc_complete_event_rp0*) p_blecore_evt->data;
          UNUSED(p_gap_proc_complete);

          LOG_INFO_APP(">>== ACI_GAP_PROC_COMPLETE_VSEVT_CODE\n");
          /* USER CODE BEGIN EVT_GAP_PROCEDURE_COMPLETE */
          
          /* USER CODE END EVT_GAP_PROCEDURE_COMPLETE */
          break; /* ACI_GAP_PROC_COMPLETE_VSEVT_CODE */
        }
        case ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE:
        {
          /* USER CODE BEGIN RADIO_ACTIVITY_EVENT */
          
          /* USER CODE END RADIO_ACTIVITY_EVENT */
          break; /* ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE */
        }
        case ACI_GAP_PASS_KEY_REQ_VSEVT_CODE:
        {
          uint32_t pin;
          LOG_INFO_APP(">>== ACI_GAP_PASS_KEY_REQ_VSEVT_CODE\n");

