STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA25CE/Applications/BLE/BLE_Beacon_Scanner_AoA_Locator/STM32_WPAN/App/app_ble.c
  memcpy(&a_BLE_CfgErValue[0], a_cfg_er_value,16);

  if(memcmp(&a_BLE_CfgErValue[0], &a_BLE_CfgErValueNull[0], 16) != 0)
  {
    p_er_value = (const uint8_t *)a_BLE_CfgErValue;
  }
  else
  {
    uid_word1 = LL_GetUID_Word1();
    uid_word2 = LL_GetUID_Word2();

    /* USER CODE BEGIN BleGenerateERValue_2 */
    
    /* USER CODE END BleGenerateERValue_2 */

   if ((uid_word1 != 0xFFFFFFFF) && (uid_word2 != 0xFFFFFFFF))
    {

    /**
     * Encryption root key is built from bits of the UDN.
     */
      a_BLE_CfgErValue[0] = a_BLE_CfgErValue[8] = (uint8_t)(uid_word2 & 0x000000FF);
      a_BLE_CfgErValue[1] = a_BLE_CfgErValue[9] = (uint8_t)((uid_word2 & 0x0000FF00) >> 8);
      a_BLE_CfgErValue[2] = a_BLE_CfgErValue[10] = (uint8_t)((uid_word2 & 0x00FF0000) >> 16);
      a_BLE_CfgErValue[3] = a_BLE_CfgErValue[11] = (uint8_t)((uid_word2 & 0xFF000000) >> 24);
      a_BLE_CfgErValue[4] = a_BLE_CfgErValue[12] = (uint8_t)~(uid_word1 & 0x000000FF);
      a_BLE_CfgErValue[5] = a_BLE_CfgErValue[13] = (uint8_t)~((uid_word1 & 0x0000FF00) >> 8);
      a_BLE_CfgErValue[6] = a_BLE_CfgErValue[14] = (uint8_t)~((uid_word1 & 0x00FF0000) >> 16);
      a_BLE_CfgErValue[7] = a_BLE_CfgErValue[15] = (uint8_t)~((uid_word1 & 0xFF000000) >> 24);
      p_er_value = (const uint8_t *)a_BLE_CfgErValue;
    }
    else
    {
      memcpy(&a_BLE_CfgErValue[0], a_BLE_CfgErValueDefault,16);
      p_er_value = (const uint8_t *)a_BLE_CfgErValue;
    }
  }

  /* USER CODE BEGIN BleGenerateERValue_3 */
  
  /* USER CODE END BleGenerateERValue_3 */
  return p_er_value;
}

static void gap_cmd_resp_release(void)
{
  UTIL_SEQ_SetEvt(1U << CFG_EVENT_PROC_GAP_COMPLETE);
  return;
}

static void gap_cmd_resp_wait(void)
{
  UTIL_SEQ_WaitEvt(1U << CFG_EVENT_PROC_GAP_COMPLETE);
  return;
}

/**
  * @brief  Notify the LL to resume the flow process
  * @param  None
  * @retval None
  */
static void BLE_ResumeFlowProcessCallback(void)
{
  /* Receive any events from the LL. */
  change_state_options_t notify_options;

  notify_options.combined_value = 0x0F;

  ll_intf_chng_evnt_hndlr_state( notify_options );
}

static void BLE_NvmCallback(SNVMA_Callback_Status_t CbkStatus)
{
  if (CbkStatus != SNVMA_OPERATION_COMPLETE)
  {
    /* Retry the write operation */
    SNVMA_Write (APP_BLE_NvmBuffer, BLE_NvmCallback);
  }
}

/* USER CODE BEGIN FD_LOCAL_FUNCTION */

static void print_beacon_data(uint16_t adv_data_len, uint8_t * adv_data, char * head_string)
{
  uint8_t i = 0;
  uint16_t AD_len;
  uint8_t AD_type;
  uint8_t * uuid;
  uint16_t major, minor;
  uint8_t beacon_found = FALSE;
  
  const uint8_t ibeacon_company_id[2] = {0x4C, 0x00};
  const uint8_t ibeacon_beacon_type[2] = {0x02, 0x15};
  
  while(i < adv_data_len){
    AD_len = adv_data[i];
    AD_type = adv_data[i+1];
    
    /* Identify only iBeacons */
    if(AD_len == 0x1A && AD_type == AD_TYPE_MANUFACTURER_SPECIFIC_DATA &&
       memcmp(&adv_data[i+2], ibeacon_company_id, 2) ==0 && memcmp(&adv_data[i+4], ibeacon_beacon_type, 2) == 0)
    {
      uuid = &adv_data[i+6];
      major = BE_TO_HOST_16(adv_data+i+22);
      minor = BE_TO_HOST_16(adv_data+i+24);
      LOG_INFO_APP("%s UUID: %08X-%04X-%04X-%04X-%08X%04X ", head_string, (unsigned int) BE_TO_HOST_32(uuid),(unsigned int) BE_TO_HOST_16(uuid+4),(unsigned int) BE_TO_HOST_16(uuid+6),\
        (unsigned int) BE_TO_HOST_16(uuid+8),(unsigned int) BE_TO_HOST_32(uuid+10),(unsigned int) BE_TO_HOST_16(uuid+14));
      LOG_INFO_APP("Major: %d  Minor: %d ", major, minor);
      beacon_found = TRUE;
      break;
    }
    i += AD_len+1;
  }
  
  if(beacon_found)
  {
    print_adv_name(adv_data_len, adv_data);
    LOG_INFO_APP("\r\n");
  }
  
}

static void print_adv_name(uint16_t adv_data_len, uint8_t * adv_data)
{
  uint8_t i = 0;
  uint16_t AD_len;
  uint8_t AD_type;
  char * name;
  
  while(i < adv_data_len){
    AD_len = adv_data[i];
    AD_type = adv_data[i+1];
    
    if(AD_type == AD_TYPE_COMPLETE_LOCAL_NAME || AD_type == AD_TYPE_SHORTENED_LOCAL_NAME)
    {
      name = (char *)&adv_data[i+2];
      for(uint16_t j = 0; j < AD_len-1; j++)
      {
        LOG_INFO_APP("%c", name[j]);
      }
      break;
    }
    i += AD_len+1;
  }
}


/* USER CODE END FD_LOCAL_FUNCTION */

/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/

/**
  * @brief Callback called by the BLE stack (from BleStack_Process() context)
  * to send an indication to the application. The indication is a BLE standard
  * packet that can be either an ACI/HCI event or an ACL data.
  * @param data: pointer to the data of the packet
  * @param length: length of the data of the packet
  * @param ext_data: pointer to the extended data
  * @param ext_length: extended data length
  * @retval Status of the operation
  */

tBleStatus BLECB_Indication( const uint8_t* data,
                          uint16_t length,
                          const uint8_t* ext_data,
                          uint16_t ext_length )
{
  uint8_t status = BLE_STATUS_FAILED;
  BleEvtPacket_t *phcievt = NULL;
  uint16_t total_length = (length+ext_length);

  UNUSED(ext_data);

  /* USER CODE BEGIN BLECB_Indication */

  /* USER CODE END BLECB_Indication */

  if (data[0] == HCI_EVENT_PKT_TYPE)
  {
    BLE_EVENTS_ResumeFlowProcessCb.Callback = BLE_ResumeFlowProcessCallback;
    if (AMM_Alloc (CFG_AMM_VIRTUAL_BLE_EVENTS,
                   DIVC((sizeof(BleEvtPacketHeader_t) + total_length), sizeof (uint32_t)),
                   (uint32_t **)&phcievt,
                   &BLE_EVENTS_ResumeFlowProcessCb) != AMM_ERROR_OK)
    {
      LOG_INFO_APP("Alloc failed\n");
      status = BLE_STATUS_FAILED;
    }
    else if (phcievt != (BleEvtPacket_t *)0 )
    {
      phcievt->evtserial.type = HCI_EVENT_PKT_TYPE;
      phcievt->evtserial.evt.evtcode = data[1];
      phcievt->evtserial.evt.plen  = data[2];
      MEMCPY( (void*)&phcievt->evtserial.evt.payload, &data[3], data[2]);
      LST_insert_tail(&BleAsynchEventQueue, (tListNode *)phcievt);
      UTIL_SEQ_SetTask(1U << CFG_TASK_HCI_ASYNCH_EVT_ID, CFG_SEQ_PRIO_0);
      status = BLE_STATUS_SUCCESS;
    }
  }
  else if (data[0] == HCI_ACLDATA_PKT_TYPE)
  {
    status = BLE_STATUS_SUCCESS;
  }
  return status;
}

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
#if (CFG_BUTTON_SUPPORTED == 1)
void APP_BSP_Button1Action(void)
{
  
  return;
}

void APP_BSP_Button2Action(void)
{
  
  return;
}

void APP_BSP_Button3Action(void)
{
  
  return;
}
#endif
/* USER CODE END FD_WRAP_FUNCTIONS */
